import { Generate } from "./generate.js";
import { Check_Ans } from "./check.js";
/*
    関数Check_Ans(Ｎ)

    引数：マス目の大きさ,ＮｘＮで生成
    戻り値：ＮｘＮのパズルを返す
            空白マスは-1で表現
*/
const grid = [
    [ 0, 0, 0, 0, 0, 1, 0, 1, 0],
    [ 0, 0, 0,-1, 1, 2, 0,-1, 1],
    [ 0, 0, 0, 1, 0, 0, 0, 0, 0],
    [ 0,-1, 1,-1, 0, 0, 0,-1, 1],
    [ 0, 1, 0, 0, 0, 0, 0, 1, 0],
    [ 1,-1, 0, 0, 0,-1, 1,-1, 0],
    [ 0, 1, 0, 0, 0, 1, 0, 0, 0],
    [ 0,-1, 1, 3, 1,-1, 0, 0, 0],
    [ 0, 0, 0, 1, 0, 0, 0, 0, 0]
]

let e;
if( (e = Check_Ans(grid)) == true){
    /*パズルが完成した時の処理 */
    console.log("クリアー");
}else if(e != false){
    /*パズルの　マス目と周囲の線の数が一致しなかった場合、
        一致しなかったマスの場所をgrid関数上の座標で配列で返す。
            例：[[1,5],[5,7]]　i:1,j:5とi:5,j:7が一致しなかった場合

        どこが間違ってるよー、みたいな表示に使えたらいいかなーみたいな
    */
    console.log(e);
}else{/*輪になっていない場合 */}